{
    "summaries": [
    {
            "week": 6,
            "title": "Week 6 Recap: Champ 99 Course",
            "content": "<p>Week 6 brought the league to <i>Golden Tee Classic Championship 99 Course</i>, not to be confused with its mischievous sibling Bonnie Blue Black — a distinction worth repeating, as the layout rewarded precision while punishing even the slightest lapse in focus. Despite its subtle traps and tight landing zones, players handled the course with surprising confidence, and the leaderboard saw its biggest shake-up of the season.</p><p><b>CJ Staugler</b> and <b>Cory Hathaway</b> posted steady scores in the upper 40s, keeping themselves anchored in the top tier but feeling the heat from the surging pack behind them. Consistent rounds from <b>Eric</b> and <b>Chad</b> kept them in striking distance as well, ensuring no one feels safe heading into the tougher tracks ahead.</p><p>With Bonnie Moor Black behind us, the standings have never been tighter — just five strokes separate 2nd from 10th place, and confidence, fatigue, and a touch of luck are all beginning to play their roles. Week 6 sends the league to the <i>Golden Tee CHAMP ’99 Championship Course</i>, a notoriously unforgiving test that could completely rewrite the board. Buckle up — the season’s defining stretch starts now.<p>"
    },
      {
        "week": 5,
        "title": "Week 5 Recap: Bonnie Moore Black",
        "content": "<p>Week 5 brought the league to <i>Bonnie Moore Black</i>, not to be confused with its mischievous sibling Bonnie Blue Black — a distinction worth repeating, as the layout rewarded precision while punishing even the slightest lapse in focus. Despite its subtle traps and tight landing zones, players handled the course with surprising confidence, and the leaderboard saw its biggest shake-up of the season.</p><p><b>CJ Staugler</b> and <b>Cory Hathaway</b> posted steady scores in the upper 40s, keeping themselves anchored in the top tier but feeling the heat from the surging pack behind them. Consistent rounds from <b>Eric</b> and <b>Chad</b> kept them in striking distance as well, ensuring no one feels safe heading into the tougher tracks ahead.</p><p>With Bonnie Moor Black behind us, the standings have never been tighter — just five strokes separate 2nd from 10th place, and confidence, fatigue, and a touch of luck are all beginning to play their roles. Week 6 sends the league to the <i>Golden Tee CHAMP ’99 Championship Course</i>, a notoriously unforgiving test that could completely rewrite the board. Buckle up — the season’s defining stretch starts now.<p>"
      },
      {
        "week": 4,
        "title": "Week 4 Recap: Missour Hills Was Rather Hilly",
        "content": "<p>Week 4 brought the league to Missouri Hills, a layout known for punishing elevation changes, deceptive winds, and a back nine that rarely gives anyone a break. Despite that, the competition tightened across the board as handicaps began to settle into place — and a few players showed they’re adapting quickly to mid-season form.</p><p>CJ Staugler continued his strong campaign, posting a smooth 48 and once again proving he’s the most consistently dangerous scorer week-to-week. Donny and Eric put in steady rounds of 55 and 50, keeping themselves well within striking distance. Meanwhile, Drew Braun turned in one of the most impressive Week 4 performances with a 52, bouncing back in style and showing he’s a threat to climb the leaderboard fast.</p><p>With Missouri Hills behind us, the standings continue to tighten as handicaps shift and players settle into rhythm. Week 5 has the potential to be the biggest shake-up yet — especially as fatigue, confidence, and course familiarity all start to collide.</p>"
      },
      {
        "week": 3,
        "title": "Week 3 Recap: Pine Coast Delivers Drama",
        "content": "<p>Week 3 of the Celina Moose Golden Tee League brought the crew to the scenic but punishing <i>Pine Coast</i>, and the leaderboard tightened up fast. The course was firm, the wind was unpredictable, and mistakes added up quick for anyone who got greedy. But even with the tricky conditions, a handful of players rose to the challenge. <b>CJ Staugler</b> led the pack with a smooth 50, showing off consistent control that kept him ahead of the field. He wasn’t alone, though — <b>Eric Sams</b> (53) and <b>Gabe Archer</b> (54) kept the pressure on all night, each posting strong, steady rounds that showed Pine Coast wasn’t scaring everyone.</p><p>Meanwhile, some of the league’s usual contenders found themselves battling the course more than their opponents. <b>Chicken’s</b> aggressive line on a few dangerous holes came back to bite him, leaving him with a 70 — the kind of round Pine Coast saves just for the brave (or unlucky).</p><p>Despite the challenges, Week 3 was full of tight battles, clutch putts, and plenty of “what-if” moments. With handicaps now fully in play starting this week, the standings are about to get even more interesting. Pine Coast may be in the rearview, but the season is just getting warmed up — buckle in, because Week 4 is coming fast.</p><p><h3>WEEK 4 COURSE: Missouri Hills</h3></p>"
      },
      {
        "week": 2,
        "title": "Week 2 Recap: Staugler Stays Hot, Monroe Finds Momentum",
        "content": "<p>The second week of the Golden Tee League brought more fireworks as <b>CJ Staugler</b> continued his hot streak, following up last week’s 54 with a sharp 49 that kept him atop the leaderboard. <b>Donny</b> and <b>Eric Sams</b> held strong with matching totals, showing consistency that could pay off once handicaps kick in after week three.</p>\n\n<p>Meanwhile, <b>Brian Monroe</b> shaved a few strokes off his debut score and hinted at a breakout week ahead. With players still adjusting to the greens and getting a feel for competition, the standings are tight — and the tension’s already building for next week’s round.</p>"
      }
    ]
  }